from string import Template

#RAG PROMPTS 

#SYSTEM 
system_prompt = Template("\n".join([
         "أنت مساعد لتوليد استجابة للمستخدم.",
         "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
         "عليك توليد استجابة بناءً على المستندات المقدمة.",
         "تجاهل المستند إذا لم يكن ذا صلة بالاستعلام.",
         "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
         "عليك توليد استجابة بنفس لغة استعلام المستخدم.",
         "كن مهذبًا ومحترمًا للمستخدم.",
         "كن دقيقًا ومختصرًا في استجابتك. تجنب المعلومات غير الضرورية.",
]))

# Document 

document_prompt = Template(
        "\n".join([
        "## المستند رقم: $doc_num",
        "## المحتوى: $chunk_text",
]))

# Footer 

footer_prompt = Template(
        "\n".join([
        "بناءً على المستندات أعلاه، يرجى توليد إجابة لسؤال المستخدم.",
        "## سؤال المستخدم:",
        "$user_question",
        "",
        "## الإجابة:",
]))